//
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
//
// let time = +prompt('Введіть число від 0 до 59');
// if (time > 0 && time <= 15) {
//     document.write('I чверть');
// } else if (time > 15 && time <= 30) {
//     document.write('ІІ чверть');
// } else if (time > 30 && time <= 45) {
//     document.write('ІІІ чверть');
// } else if (time > 45 && time < 60) {
//     document.write('ІV чверть');
// } else {
//     document.write('ПОМИЛКА')
// }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//

// let day = +prompt('Введіть число від 1 до 31');
// if (day > 0 && day <= 10) {
//     document.write('Перша декада');
// } else if (day > 10 && day <= 20) {
//     document.write('Друга декада');
// } else if (day > 20 && day <= 31) {
//     document.write('Третя декада');
// } else {
//     document.write('Введіть правильне число!!!!!')
// }


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
//
// let test = NaN;
// if (test){
//     console.log('Вірно');
// } else {
//     console.log('Неправильно');
// }

// let test = 'Тернарка';
// (test) ? console.log('ВІРНО') : console.log('НЕВІРНО');




// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//

 // let a = ((+prompt('Потрібно ввести 1, 0, -3')) !==0 ) ? console.log('Virno') : console.log ('Nevirno');


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//

// let day = prompt('Введіть порядковий номер дня тижня');
// switch (day) {
//     case '1':
//         console.log('Понеділок - робота');
//         break;
//     case '2':
//         console.log('Вівторок - басейн');
//         break;
//     case '3':
//         console.log('Середа - кіно');
//         break;
//     case '4':
//         console.log('Четвер - бар');
//         break;
//     case '5':
//         console.log(' Пятниця - прибрати вдома');
//         break;
//     case '6':
//         console.log('Субота - поїздка на дачу');
//         break;
//     case '7':
//         console.log('Неділя - планів немає');
//         break;
//
//     default :
//         console.log('Введіть правильний день тижня');
//
// }



// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//
// let year = +prompt('Введіть кількість днів у році');
// if (year%4 === 0 ){
//     document.write('Рік високосний');
// } else {
//     document.write('Рік невисокосний');
// }



// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let nameJS = prompt('Яка «офіційна» назва JavaScript?');
// if (nameJS === 'ECMAScript') {
//     document.write('Правильно!');
// } else {
//     document.write('Не знаєте? ECMAScript!');
// }