// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
//
//
// let num1 = +prompt('Введіть перше число!');
// let num2 = +prompt('Введіть друге число!');
// if (num1 > num2) {
//     console.log(num1);
// } else if (num2 > num1){
//     console.log(num2)
// } else {
//     console.log('Дані числа рівні.')
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
//
// let flat = +prompt('Введіть номер квартири');
// if (flat>=1 && flat<=20){
//     document.write('У першому підїзді');
// } else if (flat>20 && flat<49){
//     document.write('У другому підїзді');
// } else if (flat>48 && flat<=90){
//     document.write('У третьому підїзді');
// } else {
//     document.write('Введено невірний номер квартири.');
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
//
// let number = +prompt('Введіть число');
// if (number === 10) {
//     alert ('Вірно!');
// } else alert( 'Невірно!');


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
//
// let t=+prompt('Введіть температуру повітря.');
// if (t>=10 && t<=22){
//     document.write('Йдемо вчитися');
// } else {
//     document.write('Вчимося з дому');
// }


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .


// let game = +prompt('Введіть число від 1 до 5');
// switch (game) {
//     case 1:
//         document.write('Ваш приз: автомобіль');
//         break;
//     case 2:
//         document.write('Ваш приз: айфон');
//         break;
//     case 3:
//         document.write('Ваш приз: тур в Європу');
//         break;
//     case 4:
//         document.write('Ваш приз: книжка');
//         break;
//     case 5:
//         document.write('Ваш приз: ноутбук');
//         break;
//     default:
//         document.write('Введіть правильний номер (від 1 до 5) !!!!!');
//
// }
